-- ENGLISH LANGUAGE LOCALIZATION

-- Collect
SurveyZoneList.lang.collectFindName = {
    "карта сокровищ (.*)", --treasure map
    ".*: (.*)",
}

SurveyZoneList.lang.surveyAction = {
    "Рубить",
    "Взять",
    "Собрать",
    "Добыть"
}

SurveyZoneList.lang.surveyType = {
    clothier        = {"clothier"},
    reagent         = {"alchemist"},
    enchanting      = {"enchanter"},
    blacksmithing   = {"blacksmith"},
    jewerlycrafting = {"jewelry"},
    woodworking     = {"woodworker"}
}

SurveyZoneList.lang.nodeName = {
    "^нетронутый",
    "^изобилие",
    "^залежи",
    "^ловушка меховщика$",
    "^богатый",
    "^многогранный"
    
    -- bois
    -- Survey : [03:58] [03:58] Рубить / Нетронутый багряный ясень
    -- Normal : [03:59] [03:59] Рубить / Багряный ясень

    -- enchantement
    -- survey : [04:27] [04:27] Взять / Многогранный рунный камень
    -- normal : [04:02] [04:02] Взять / Рунный камень

    -- couture
    -- survey : [04:21] [04:21] Взять / Изобилие шелка предков
    --          [04:21] [04:21] Взять / Ловушка меховщика
    -- normal : [03:58] [03:58] Взять / Шелк предков

    -- alchimie
    -- survey : [04:03] [04:03] Собрать / Изобилие василька
    --          [04:03] [04:03] Собрать / Изобилие полыни
    --          [04:03] [04:03] Собрать / Изобилие водосбора
    --          [04:03] [04:03] Собрать / Изобилие драконьего шипа
    -- normal : [03:59] [03:59] Взять / Горноцвет
    --          [04:14] [04:14] Взять / Водный гиацинт
    --          [04:14] [04:14] Взять / Полынь

    -- forge
    -- survey : [04:18] [04:18] Добыть / Залежи рубедитовой руды
    -- normal : [03:57] [03:57] Добыть / Рубедитовая руда

    -- joaillerie
    -- survey : [04:24] [04:24] Добыть / Богатый платиновый пласт
    -- normal : [03:57] [03:57] Добыть / Платиновый пласт
}
